Rhino.Inside.Revit API
GeometryEncoder.ToOutline Method
 Converts the specified Rhino.Geometry.BoundingBox to an equivalent Autodesk.Revit.DB.Outline.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Outline ToOutline(
	this Rhino.Geometry.BoundingBox boundingBox
)
@staticmethod
def ToOutline(
	boundingBox: Rhino.Geometry.BoundingBox
) -> Autodesk.Revit.DB.Outline
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
Rhino bounding box to convert.
Return Value
Type: Autodesk.Revit.DB.Outline
Revit outline that is equivalent to the provided Rhino bounding box.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.BoundingBox. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToOutline(BoundingBox) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Outline revitOutline = rhinoBBox.ToOutline();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_outline = rhino_bbox.ToOutline()    # type: DB.Outline
 Using ToOutline(BoundingBox) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Outline revitOutline = GeometryEncoder.ToOutline(rhinoBBox);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_outline = GE.ToOutline(rhino_bbox)    # type: DB.Outline
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace